import React from 'react'

class Theory4 extends React.Component {

    render() {
        return( 
            <div className="theory-card">
                <p><b>Государство</b> – политико-территориальная суверенная организация публичной власти, располагающая специальным аппаратом и обязательной для исполнения всеми гражданами волей. Государство является главным институтом политической системы.</p>
                <p>Основные признаки государства:
                <ul>
                <li>территориальная организация власти;</li>
                <li>публичный характер власти;</li>
                <li>суверенный характер власти;</li>
                <li>принудительный характер власти;</li>
                <li>исключительное право на взимание налогов и сборов и выпуск (эмиссию) денег;</li>
                <li>обязательность членства в государстве;</li>
                <li>представительство общества как целого, защита общих интересов и общего блага;</li>
                <li>наличие государственной символики (герб, флаг, гимн).</li>
                </ul></p>

                <p>Дополнительные признаки государства:
                <ul>
                <li>государственный язык как средство общения;</li>
                <li>единая оборонная внешняя политика;</li>
                <li>единая транспортная, информационная, энергетическая системы и др.</li>
                </ul></p>

                <p>Признаки правового государства:
                <ul>
                <li>верховенство права и закона во всех сферах жизни общества, в том числе и над самим государством. Деятельность государства ограничена рамками права;</li>
                <li>существует реальное разделение властей;</li>
                <li>взаимная ответственность личности и государства;</li>
                <li>равенство всех перед законом;</li>
                <li>реальность прав и свобод человека и гражданина, их правовая и социальная защищенность; признание их высшей ценностью;</li>
                <li>политический и идеологический плюрализм, выражающийся в существовании различных партий, течений, организаций, действующих в рамках конституции, наличие различных идеологических концепций и взглядов;</li>
                <li>стабильность законности и правопорядка в обществе</li>
                </ul></p>

                <p><b>Форма государства</b> – устройство политической организации общества, призванное обеспечить ее стабильность и нормальное функционирование.</p>
                <table border="1" className="theory-table">
                <caption>Форма государства</caption>
                <tr>
                    <th>Форма правления</th>
                    <th>Форма государственно-территориального устройства</th>
                    <th>Политический режим</th>
                </tr>
                <tr>
                    <td>Способ организации верховной государственной власти</td>
                <td>Способ взаимосвязи территориальных образований государства, закрепленный конституцией</td>
                <td>Совокупность методов и способов осуществления в стране государственной власти и управления</td>
                </tr>
                <tr>
                    <td>
                        <ol>
                            <li><b>Монархия</b>
                    <ul>
                        <li>Единоличным главой государства является монарх; </li>
                        <li>Власть переходит по наследству;</li>
                        <li>Монарх юридически безответственен (отстранить монарха от власти невозможно).</li>
                </ul>
                </li>
                            <li><b>Республика</b>
                    <ul>
                <li>Всегда существует несколько высших органов власти, при этом полномочия между ними разделены таким образом, что один орган независим от другого;</li>
                <li>Главой государства является Президент, который осуществляет свою власть от имени народа;</li>
                <li>Высшие органы власти и должностные лица несут ответственность перед населением, которая может быть выражена в следующем: они избираются на определенный срок, по истечении которого полномочия могут не  продлеваться; возможно досрочное прекращение полномочий.</li>
                </ul>
                </li>
                </ol>
                </td>
                    <td>
                    <ol>
                            <li><b>Унитарная</b>
                    <ul>
                        <li>единые, общие для всей страны, высшие представительные, исполнительные и судебные органы, которые осуществляют руководство соответствующими местными органами; </li>
                        <li>действует единая конституция, единая система законодательства, единая денежная система, одно гражданство, проводится общая для всех налоговая и кредитная политика;</li>
                </ul>
                </li>
                            <li><b>Федеративная</b>
                    <ul>
                <li>территория федерации состоит из территорий ее субъектов: штатов, кантонов, земель, республик и т. п.;</li>
                <li>в союзном государстве верховная законодательная и судебная власть принадлежат федеральным государственным органам. Компетенция между федерацией и ее субъектами разграничивается союзной конституцией;</li>
                <li>субъекты федерации обладают правом принятия собственной конституции, имеют свои высшие законодательные, исполнительные и судебные органы;</li>
                <li>основную общегосударственную внешнеполитическую деятельность осуществляют союзные государственные органы.</li>
                </ul>
                </li>
                <li><b>Конфедеративная</b>
                    <ul>
                <li>не имеет своих общих законодательных, исполнительных и судебных органов, решает проблемы экономического, оборонного и иного сотрудничества;</li>
                <li>не имеет единой армии, единой системы налогов и единого государственного бюджета;</li>
                <li>конфедеративные органы могут договориться о единой денежной системе, единых таможенных пошлинах.</li>
                </ul>
                </li>

                </ol>

                </td>
                        <td>
                            <ol>
                                <li><b>Демократический</b></li>
                <li><b>Недемократический</b> (тоталитарный, авторитарный)</li>
                </ol>
                </td>
                </tr>
                </table>
                <br></br>
                <table border="1" className="theory-table">
                <caption>Виды республик</caption>
                <tr>
                    <th></th>
                    <th>Парламентская республика</th>
                <th>Президентская республика</th>
                <th>Смешанная республика</th>
                </tr>
                <tr>
                    <td>1. Статус президента</td>
                <td>должность символична, осуществляет представительские функции, все действия и принимаемые акты требуют контрасигнатуры</td>
                <td>одновременно глава государства и глава исполнительной власти</td>
                <td>глава государства, но выведен из системы разделения властей, является арбитром и гарантом Конституции</td>
                </tr>
                <tr>
                <td>2. Способ избрания президента</td>
                <td>мандат получает от парламента</td>
                <td>мандат получает от народа в ходе всеобщих выборов</td>
                <td></td>
                </tr>
                <tr>
                <td>3. Порядок формирования правительства</td>
                <td>парламентом на основе парламентского большинства</td>
                <td>президентом</td>
                <td>совместно президентом и парламентом (президент представляет кандидатуру премьер-министра, а парламент его утверждает)</td>
                </tr>
                <tr>
                <td>4. Ответственность правительства</td>
                <td>перед парламентом</td>
                <td>перед президентом (парламент не может выразить вотум недоверия)</td>
                <td>одновременно перед президентом и парламентом</td>
                </tr>
                <tr>
                <td>5. Наличие у президента законодательной инициативы</td>
                <td>отсутствует</td>
                <td>имеется</td>
                <td>как правило отсутствует, но в некоторых странах такое право есть</td>
                </tr>
                <tr>
                    <td>6. Право вето президента на решения парламента</td>
                <td>отсутствует</td>
                <td>сильное право вето (преодолевается квалифицированным большинством парламента)</td>
                <td>как правило слабое право вето (преодолевается простым большинством парламента), в некоторых странах у президента может быть сильное право вето</td>
                </tr>
                <tr>
                <td>7. Право президента распустить парламент</td>
                <td>используется в крайнем случае, когда иным образом разрешить проблему невозможно</td>
                <td>отсутствует</td>
                <td>имеется</td>
                </tr>
                <tr>
                <td>8. Наличие поста премьер-министра</td>
                <td>имеется</td>
                <td>отсутствует</td>
                <td>имеется</td>
                </tr>
                <tr>
                    <td>9. Современные страны</td>
                <td>ФРГ, Италия, Австрия</td>
                <td>США, Аргентина, Мексика</td>
                <td>Франция, Румыния, Россия</td>
                </tr>
                </table>
                <br></br>
                <table border="1" className="theory-table">
                <caption>Виды монархий</caption>
                <tr>
                    <th></th>
                <th>Абсолютная монархия</th>
                <th>Дуалистическая монархия</th>
                <th>Парламентарная монархия</th>
                </tr>
                <tr>
                    <td>1. Принадлежность законодательной власти</td>
                <td>монарху</td>
                <td>разделена между монархом и парламентом</td>
                <td>парламенту</td>
                </tr>
                <tr>
                    <td>2. Осуществление исполнительной власти</td>
                <td>монарх</td>
                <td>формально - монарх, фактически - правительство</td>
                <td>правительство</td>
                </tr>
                <tr>
                    <td>3. Назначение главы правительства</td>
                <td>монарх</td>
                <td>формально - монарх, но с учётом парламентских выборов</td>
                <td>парламентом</td>
                </tr>
                <tr>
                    <td>4. Ответственность правительства</td>
                <td>перед монархом</td>
                <td>перед парламентом</td>
                <td>перед парламентом</td>
                </tr>
                <tr>
                    <td>5. Право роспуска парламента</td>
                <td>нет парламента</td>
                <td>у монарха (неограниченное)</td>
                <td>у монарха (по рекомендации правительства)</td>
                </tr>
                <tr>
                    <td>6. Право вето монарха на решения парламента</td>
                <td>нет парламента</td>
                <td>абсолютное вето</td>
                <td>предусмотрено, но не используется</td>
                </tr>
                <tr>
                    <td>7. Чрезвычайно-указное законодательство монарха</td>
                <td>неограниченное (указ монарха имеет силу закона)</td>
                <td>только в период между сессиями парламента</td>
                <td>предусмотрено, но не используется</td>
                </tr>
                <tr>
                <td>8. Современные страны</td>
                <td>Саудовская Аравия, Оман</td>
                <td>Иордания, Кувейт, Марокко</td>
                <td>Великобритания, Испания, Нидерланды</td>
                </tr>
                </table>

            </div>
        );
    }
}

export default Theory4;