import React from 'react'

class Theory3 extends React.Component {

    render() {
        return( 
            <div className="theory-card">
                <p><b>Семья</b> - основанная на браке или кровном родстве малая группа.</p>
                <p><b>Семья</b> — основной социальный институт, способствующий удовлетворению важнейших человеческих потребностей, в первую очередь, воспроизведение самого человека.</p>
                <p><b>Семья</b> — малая социальная группа, основанная на браке или кровном родстве, связана личностными отношениями, общностью быта и взаимной ответственностью.</p>
                <p>Функции семьи:
                <ul>
                <li><b>репродуктивная</b> — биологическое воспроизводство населения;</li>
                <li><b>социализации личности</b> — является первичным агентом социализации, под ее влиянием формируется личность;</li>
                <li><b>хозяйственно-бытовая</b> — ведение домашнего хозяйства, уход за детьми и нетрудоспособными членами семьи;</li>
                <li><b>экономическая</b> — накопление и передача собственности, материальная поддержка членов семьи;</li>
                <li><b>социально-статусная</b> — наделение человека наследственным статусом, например, национальность, принадлежность к определенной династии, сословию;</li>
                <li><b>психологическая</b> — оказание эмоциональной поддержки членам семьи;</li>
                <li><b>защитная</b> — физическая, экономическая, психологическая защита членов семьи;</li>
                <li><b>духовно-нравственная</b> — личностное развитие членов семьи;</li>
                <li><b>досуговая</b> — организация рационального досуга, семейный отдых.</li>
                </ul></p>

                <p>Классификация семейных структур:
                <ul>
                <li><b>Моногамные</b> семьи основаны на браке одного мужчины с одной женщиной. <b>Полигамные</b> — множественный брак, бывает двух видов: полигиния — брак одного мужчины с несколькими женщинами (гарем); полиандрия — брак одной женщины с несколькими мужчинами.</li>
                <li><b>Патрилинеальные семьи</b> — наследование фамилии, имущества и социального положения ведется по отцу, <b>матрилинеальные</b> — по матери.</li>
                <li><b>Патриархальные семьи</b> — главой является отец. <b>Матриархальные</b> — наивысшим авторитетом и влиянием пользуется мать. <b>Партнерские</b> — супруги равноправны, рациональное распределение обязанностей.</li>
                <li><b>Нуклеарные</b> — состоящие из супружеской пары и зависящих от них несовершеннолетних детей. <b>Расширенные</b> — совместное проживание нескольких поколений родственников (родители, дети, бабушки, дедушки, тети, племянники).</li>
                <li><b>Бездетные, малодетные, многодетные</b> (трое и более детей).</li>
                <li><b>Авторитарные</b> - основаны на жестком авторитете родителей. <b>Либеральные</b> - строятся на самоопределении личности, независимо от привычек, обычаев. <b>Демократические</b> - основаны на равноправном участии всех членов семьи в решении важнейших семейных вопросов.</li>
                </ul></p>

                <p>Основные тенденции в развитии современной семьи:
                <ul>
                <li>преобладание нуклеарных, малодетных семей;</li>
                <li>распространение семей партнерского типа;</li>
                <li>повышение среднего возраста вступления в брак;</li>
                <li>распространение сожительства, пробных браков, возникновение в некоторых странах однополых браков;</li>
                <li>сокращение ведущих позиций семьи в социализации индивида (связано с активным участием женщин в общественных отношениях: карьера, бизнес, политика, работающие бабушки).</li>
                </ul></p>

            </div>
        );
    }
}

export default Theory3;