import React from 'react'

class Theory2 extends React.Component {

    render() {
        return( 
            <div className="theory-card">
                <p> <b>Налоги</b>- безвозмездная уплата денежных сумм (суммы налога) государству в соответствии с налоговым законодательством. </p>
                <p> <b>Субъект налога</b>  (налогоплательщик) – юридическое или физическое лицо, на которое законодательно возложено обязательство платить налоги. </p>
                <p><b> Объект налога</b> - то, что имеет стоимостную или физическую характеристику и подлежит налогообложению, а это: прибыль, имущество, реализация товаров и услуг, доход. </p>
                <p><b> Носитель налога</b> — лицо, из дохода которого выплачивается налог; </p>
                <p> <b>Источник налога </b> — средства, из которых выплачивается налог (прибыль, заработная плата и т. д.); </p>
                <p> <b>Единица обложения</b>— единица измерения объекта налогообложения (рубль, гектар и т. д.); </p>
                <p> <b>Налоговая ставка </b> — величина налога с единицы обложения. </p>
                <p> <b>Налоговые льготы </b> — уменьшение налоговых ставок, изъятие из обложения определенных элементов объекта налога (например, амортизационных отчислений), освобождение от налогов и т. д. Они устанавливаются, как и налог, в порядке и на условиях, определяемых законодательными актами. </p>
                <p> <b>Налоговые платежи </b> — виды и группы налогов; </p>
                <p> <b>Налоговая база</b>— сумма, с которой взимается налог; денежный или физический эквивалент объекта налога. </p>
                <p> <b>Налоговое бремя</b> — отношение налоговой суммы к доходу. </p>

                <p> В <b>права налогоплательщика</b> входит:</p>
                <ul>
                <li> Получение сведений о состоянии налогов на данный момент времени. </li>
                <li> Использование налоговых льгот, если это возможно. </li>
                <li> Обжалование заключения налоговых органов. </li>
                <li> Присутствие при налоговом инспектировании. </li>
                </ul>

                <p> В <b>обязанности налогоплательщика</b> входит:</p>
                <ul>
                <li> Выплата налогов в полном размере и в указанный срок.</li>
                <li> Предоставление налоговой службе необходимых документов и информации.</li>
                <li> Хранение налоговых отчетов на протяжении четырёх лет.</li>
                <li> Ведение бухгалтерского учета.</li>
                <li> Информирование налоговых служб о любой произведенной финансовой операции.</li>
                </ul>

                <p><b>Налоговая политика </b>– совокупность мероприятий государства по наиболее успешному установлению налогообложения в интересах и государства, и налогоплательщиков. </p>

                <p>Выделяют <b>три базовых системы налогообложения,</b>в зависимости от формы налоговой ставки (величины налога, соотносящейся с единицей налогообложения):</p>
                <ul>
                <li>Прогрессивное налогообложение – чем более высокий уровень дохода, тем выше соответственно и налоговая ставка. Иными словами, люди зарабатывают больше = платят налогов больше</li>
                <li>Регрессивное налогообложение – чем более высокий уровень дохода, тем ниже налоговая ставка. Люди зарабатывают больше = платят налогов меньше. </li>
                <li>Пропорциональное налогообложение – налоговая ставка зафиксирована и не колеблется, несмотря на изменения размера получаемых доходов. </li>
                </ul>

                <p>Налоги делятся на:</p>
                <ul>
                <li><b>Прямые</b> – общеобязательные налоги с доходов налогоплательщика или его имущества. </li>
                <li><b>Косвенные</b>, взимаемые путем установления надбавок к стоимости товаров и услуг. </li>
                </ul>

                <p>Помимо классификации налогов, существуют <b>принципы налогообложения</b> – правила составления порядков налогообложения: </p>
                <ul>
                <li>Справедливость налогов касательно всех уровней дохода. </li>
                <li>Удобство в оплате налогов  во времени и способе. </li>
                <li>Точность и определенность – налогоплательщик должен понимать, в зависимости от чего начисляются налоги, порядок и сроки налогообложения. </li>
                <li>Экономичность (эффективность) </li>
                </ul>


                <table border="1" className="theory-table">
                <caption> Функции налогообложения</caption>
                <tr>
                <th> Функция </th>
                <th> Сущность </th>
                <th> Пример </th>
                </tr>
                <tr>
                <td><b> Фискальная </b></td>
                <td>Формирование финансовых ресурсов путем пополнения госбюджета с последующим финансированием разных сфер общества</td>
                <td> Зарплата Руслана составляет 67000 рублей, 3000 из которых ежемесячно начисляются в пенсионный фонд.</td>
                </tr>
                <tr>
                <td><b> Распределительная </b></td>
                <td>Перераспределение финансовых ресурсов и доходов общества в целом для сокращения дифференциации общества касательно экономического положения</td>
                <td>С относительно обеспеченных слоев населения налоги взимаются большем размере, причем большая их часть поступает в виде социальной помощи малоимущим слоям населения.</td>
                </tr>
                <tr>
                <td><b> Стимулирующая </b></td>
                <td>Налогообложение стимулирует технический прогресс, т.к. на прибыль, основная направленность которой производство товаров, предназначенных для народного потребления, налогов нет.</td>
                <td>В отдаленных селах Азербайджана молодым учителям предоставляются дополнительные льготы без вычета налогов на них.</td>
                </tr>
                <tr>
                <td><b> Социально-воспитательная</b></td>
                <td> Ограничение потребления вредно действующих товаров при помощи повышения на них налогов </td>
                <td> Курение отрицательно влияет на организм, поэтому цены на сигареты выросли из-за взимания больших налогов.</td>
                </tr>
                <tr>
                <td><b> Конкретно-учетная</b></td>
                <td>Отслеживание доходов населения</td>
                <td> По размеру налога и принадлежности человека к определенной профессии можно вычислить его доход.</td>
                </tr>
                </table>

                <p> В России налоги классифицируются следующим образом:</p>
                <table border="1" className="theory-table">
                <caption>Виды налогов в России</caption>
                <tr>
                <th><b> Федеральные </b></th>
                <th><b> Региональные </b></th>
                <th><b> Местные </b></th>
                </tr>
                <tr>
                <td>Такое налогообложение фиксируется Государственной Думой и подтверждается Советом Федерации</td>
                <td>Налоги фиксируются законодательными органами</td>
                <td>Фиксируются муниципальными официальными учреждениями</td>
                </tr>
                <tr>
                <td>Сюда входят: НДС, таможенные пошлины, налоги на покупку валюты.</td>
                <td>Сюда входят: лесные, дорожные, транспортные налоги, налогообложение на имущество предприятий.</td>
                <td>Налоги на рекламу, на содержание жилого фонда.</td>
                </tr>
                </table>

                <p>К федеральным налогам и сборам относятся: </p>
                <ul>
                <li> НДС (налог на добавленную стоимость);</li>
                <li> акциз на отдельные виды товаров (услуг) и отдельные виды минерального сырья;</li>
                <li> налог на прибыль (доход) организаций;</li>
                <li> налоги на доход от капитала;</li>
                <li> подоходный налог с физических лиц;</li>
                <li> взносы в государственные социальные внебюджетные фонды;</li>
                <li> государственная пошлина;</li>
                <li> таможенные пошлины и таможенные сборы;</li>
                <li> налоги на пользование недрами;</li>
                <li> налоги на воспроизводство минерально-сырьевой базы;</li>
                <li> лесной налог;</li>
                <li> экологический налог и др.</li>
                </ul>
                
                <p>К региональным (субъектов Федерации) налогам и сборам относятся: </p>
                <ul>
                <li> налоги на имущество организаций;</li>
                <li> налоги на недвижимость;</li>
                <li> дорожный налог;</li>
                <li>транспортный налог;</li>
                <li> налог с продаж;</li>
                <li> налоги на игровой бизнес;</li>
                <li> региональные лицензионные сборы и др.</li>
                </ul>

                <p>К местным налогам и сборам относятся: </p>
                <ul>
                <li> земельный налог;</li>
                <li> налог на имущество с физических лиц;</li>
                <li> налог на рекламу;</li>
                <li> налог на наследование и дарение;</li>
                <li> местные лицензионные сборы и др.</li>
                </ul>


            </div>
        );
    }
}

export default Theory2;