import React from 'react'

class Theory1 extends React.Component {

    render() {
        return( 
            <div className="theory-card">
                <p><b>Что такое общество?</b></p>
                <p><b>Узкое понимание:</b>
                <ul>
                <li>Группа людей, объединенных неким общим признаком (толстопузое общество)</li>
                <li>Совокупность согласованно действующих людей (общество книголюбов, союз журналистов и др.)</li>
                <li>Определенные исторические этапы развития человечества (античное общество, индустриальное общество)</li>
                <li>Специфические особенности жизни одной страны (китайское общество, российское общество)</li>
                <li>Человечество в целом</li>
                </ul></p>
                <p><b>Широкое понимание:</b>
                <ul><li>Обособившаяся от природы, но тесно связанная с ней часть мира, которая включает в себя способы взаимодействия людей и формы их объединении</li>
                </ul></p>
                <p>Сферы (подсистемы) общественной жизни:
                <ul>
                <li>Экономическая (отношения людей в процессе производства, обмена, распределения и потребления)</li>
                <li>Социальная (взаимосвязи социальных групп, слоев, общностей)</li>
                <li>Политическая (взаимодействие отдельных людей и социальных групп по вопросу о государственной власти)</li>
                <li>Духовная (религиозные, нравственные, эстетические и другие идеи, соответствующие им отношения и организации)</li>
                </ul></p>
                <p>Признаки общества как системы:
                <ul>
                <li>Целостность</li>
                <li>Устойчивость</li>
                <li>Способность к саморазвитию</li>
                <li>Открытость</li>
                </ul></p>
                <p>Общество как динамичная система:
                <ul>
                <li>Изменяется и развивается общество в целом</li>
                <li>Изменяются и развиваются его элементы</li>
                <li>Элементы общества взаимосвязаны между собой и воздействуют друг на друга</li>
                <li>Одни элементы прекращают свое существование, другие появляются</li>
                </ul></p>
                <br></br>
                <table border="1" className="theory-table">
                <caption>Различные классификации обществ:</caption>
                <tr>
                    <th>Критерий</th>
                    <th>Типы обществ</th>
                </tr>
                <tr>
                    <td>Наличие письменности</td>
                    <td><ul><li>Дописьменные</li><li>Письменные</li></ul></td>
                </tr>
                <tr>
                    <td>Число уровней управления обществом и степень его дифференциации</td>
                    <td><ul><li>Простые (нет руководителей и подчиненных, богатых и бедных)</li><li>Сложные (несколько уровней управления и несколько социальных слоев населения)</li></ul></td>
                </tr>
                <tr>
                    <td>Уровень развития</td>
                    <td><ul><li>Развитые</li><li>Развивающиеся</li><li>Отсталые</li></ul></td>
                </tr>
                <tr>
                    <td>Формационный признак</td>
                    <td><ul><li>Бесклассовые общество (первобытное общество, коммунистическое общество)</li><li>Классовое общество (рабовладельческое общество, феодальное общество, капиталистическое общество)</li>  </ul></td>
                </tr>
                </table>
                <p><b>Под влиянием чего общество изменяется и развивается?</b>
                <ul>
                <li>Натуралистический подход - «Развитие общества определяется природными факторами»</li>
                <li>Идеалистический подход - «Идеи первичны по отношению к другим сторонам человеческой деятельности»</li>
                <li>Материалистический подход - «Люди в первую очередь должны удовлетворять свои материальные потребности»</li>
                <li>Плюралистический подход - «В основе развития общества лежит не один, а множество факторов»</li>
                </ul></p>
                <p><b>Формационный и цивилизационный подходы</b></p>
                <p><b>Формационный подход</b> (основоположники К. Маркс (1818—1883) и Ф. Энгельс (1820—1895). Ключевое понятие – «общественно-экономическая формация».</p>
                <p>Общественно-экономическая формация (от лат. formatio — образование, вид) — это общество, находящееся на определенной ступени исторического развития, взятое в единстве всех его сторон, с присущим ему способом производства, экономическим строем и возвышающейся над ним надстройкой</p>
                <p>Структура:</p>
                <p><b>Надстройка</b> — это совокупность идеологических отношений, взглядов и учреждений (философия, религия, мораль, государство, право, политика и др.), возникающая на основе определенного экономического базиса, органически связанная с ним и активно воздействующая на него</p>
                <p>Способ производства:</p>
                <p><b>Базис</b> — это экономический строй (совокупность производственных отношений, т. е. отношений, не зависящих от сознания людей, в которые люди вступают в процессе материального производства)</p>
                <p><b>Производительные силы</b> — это средства производства и люди, обладающие производственным опытом, навыками к труду</p>
                <p><b>Производственные отношения</b> – отношения людей, складывающиеся в процессе производства</p>
                <p>Тип надстройки преимущественно определяется характером базиса. Он же представляет собой основу формации, определяя принад¬лежность того или иного общества.</p>
                <br></br>
                <table border="1" className="theory-table">
                <caption>Традиционное, индустриальное, информационное общество</caption>
                <tr>
                    <th>Линии сравнения</th>
                    <th>Традиционное(доиндустриальное)</th>
                <th>Индустриальное</th>
                <th>Постиндустриальное(информационное)</th>
                </tr>
                <tr>
                    <td>Основной фактор производства</td>
                    <td>Земля</td>
                <td>Капитал</td>
                <td>Знания</td>
                </tr>
                <tr>
                    <td>Основной продукт производства</td>
                    <td>Пища</td>
                <td>Промышленные изделия</td>
                <td>Услуги</td>
                </tr>
                <tr>
                    <td>Характерные черты производства</td>
                    <td>Ручной труд</td>
                <td>Широкое применение механизмов, технологий</td>
                <td>Автоматизация производства, компьютеризация общества</td>
                </tr>
                <tr>
                    <td>Характер труда</td>
                    <td>Индивидуальный труд</td>
                <td>Преимущественно стандартная деятельность</td>
                <td>Резкое повышение творческого начала в труде</td>
                </tr>
                <tr>
                    <td>Занятость населения</td>
                    <td>Сельское хозяйство — около 75%</td>
                <td>Сельское хозяйство — около 10%, промышленность — 85%</td>
                <td>Сельское хозяйство — до 3%, промышленность — около 33%, услуги — около 66%</td>
                </tr>
                <tr>
                    <td>Основной вид экспорта</td>
                    <td>Сырье</td>
                <td>Продукты производства</td>
                <td>Услуги</td>
                </tr>
                <tr>
                    <td>Социальная  структура</td>
                    <td>Сословия, классы, включенность всех в коллектив; замкнутость социальных структур; низкая социальная мобильность</td>
                <td>Классовое деление; упрощение социальной структуры; подвижность и открытость социальных структур</td>
                <td>Сохранение социальной дифференциации; рост численности среднего класса; профессиональная дифференциация в зависимости от уровня знаний, квалификации</td>
                </tr>
                <tr>
                    <td>Продолжительность жизни</td>
                    <td>40—50 лет</td>
                <td>Свыше 70 лет</td>
                <td>Свыше 70 лет</td>
                </tr>
                <tr>
                    <td>Воздействие человека на природу</td>
                    <td>Локальное, неконтролируемое</td>
                <td>Глобальное, неконтролируемое</td>
                <td>Глобальное, контролируемое</td>
                </tr>
                <tr>
                    <td>Взаимодействие с другими странами</td>
                    <td>Несущественное</td>
                <td>Тесная взаимосвязь</td>
                <td>Открытость общества</td>
                </tr>
                <tr>
                    <td>Политическая жизнь</td>
                    <td>Преобладание монархических форм правления; политические свободы отсутствуют; власть выше закона, для нее не нужны обоснования; сочетание самоуправляющихся общин и традиционных империй</td>
                <td>Провозглашение политических свобод, равенства перед законом, демократические преобразования; власть не воспринимается как данность, от нее требуется обоснование права на лидерство</td>
                <td>Политический плюрализм, сильное гражданское общество; возникновение новой формы демократии — «демократии консенсуса»</td>
                </tr>
                <tr>
                    <td>Духовная жизнь</td>
                    <td>Господствуют традиционные религиозные ценности; однородный характер культуры; преобладает устная передача информации; малое количество образованных людей; борьба с неграмотностью</td>
                <td>Утверждаются новые ценности прогресса, личного успеха, веры в науку; возникает и занимает лидирующие позиции массовая культура; подготовка специалистов</td>
                <td>Особая роль науки, образования; развитие индивидуализированного сознания; непрерывное образование</td>
                </tr>
                </table>

            </div>
        );
    }
}

export default Theory1;
